[
    {
        "id": "5254433c-a34e-4f16-ab6a-4c319e43e7ff",
        "blogNumber": 3,
        "blogType": "Article",
        "title": "Jusqu'à le réaliser, le rêve du premier jeu (la suite).",
        "description": "Dans la partie une, je vous ai raconté d'où venait l'idée de The Big One, ainsi que le début du développement. Dans cette partie deux, je vais vous détailler les réactions des joueurs grâce à la bêta et les ajouts qui ont été faits suite à cela. Vous découvrirez aussi la tournure inattendue qu'a pris le projet avec pour but de sortir le jeu sur Steam.",
        "date": "01/01/2000",
        "writer": "Julien",
        "body": [
            {
                "type": "block",
                "content": [
                    "Dans la partie une, je vous ai raconté d'où venait l'idée de The Big One, ainsi que le début du développement. Dans cette partie deux, je vais vous détailler les réactions des joueurs grâce à la bêta et les ajouts qui ont été faits suite à cela. Vous découvrirez aussi la tournure inattendue qu'a pris le projet avec pour but de sortir le jeu sur Steam."
                ]
            },
            {
                "type": "h2",
                "content": "🎮Arrivée à la première bêta."
            },
            {
                "type": "block",
                "content": [
                    "Il est là ! Mon premier jeu ! Je suis aux portes de l'accomplissement de mon plus grand rêve. Évidemment, ce rêve va beaucoup plus loin qu'une simple bêta d'un jeu auquel seulement quelques personnes auront joué, mais c'est le début de cette grande aventure. Je frissonne à l'idée d'avoir les premiers retours et l'idée de voir des personnes jouer à mon jeu me ravie.",
                    "Après l'excitation et la fierté, il est temps de se remettre en question et de comprendre ce qui ne va pas dans le jeu.",
                    "Premièrement, les retours sont unanimes : le jeu est DUR ! Extrêmement dur voire impossible. Très bien. Il faudra donc s'attarder grandement sur cette partie.",
                    "Deuxièmement, le jeu à cette époque n'était jouable qu'au clavier. Je comptais bien créer une adaptation manette, mais celle-ci serait fastidieuse à développer donc je ne voulais pas m'y attarder pour le moment. Il était clair que j'allais devoir prendre ce temps, car la jouabilité au clavier était très compliquée.",
                    "Pour ce qui est de la difficulté, j'ai commencé par réduire les dégâts des monstres. J'ai ensuite augmenté les points de vie du joueur, booster certains objets, refait certaines salles, ajouté une potion pour pouvoir se soigner en combat et tout un tas d'autres petits changements.",
                    "Le plus gros ajout aura été des compétences passives. Quand on tue des monstres, on récupère de l'expérience ainsi que de l'argent. Une fois de retour dans le HUB principal, on peut dépenser nos points pour acheter des compétences via un tableau. Augmentation des dégâts ou même de la vie, plus de potions, de l'armure et pleins d'autres choses.",
                    {
                        "subtype": "image",
                        "src": "",
                        "alt": "Tableau de compétence dans TBO",
                        "width": "",
                        "height": "",
                        "figcaption": "Tableau de compétence dans TBO"
                    },
                    "Le but de ceci est d'apporter au joueur une base de statistiques plus fortes avant même de pénétrer dans une partie. Cela permet de jouer tout en apprenant à combattre les différents monstres, puis à revenir pour acheter de quoi les battre plus facilement.",
                    "La dernière idée que j'ai eu pour rendre TBO encore plus progressif m'est venue d'un jeu fabuleux : Hadès.",
                    "Dans Hadès, une fois le end game atteint, on débloque un tableau dans lequel on peut choisir d'activer des options qui vont augmenter le niveau de difficulté de nos parties. J'ai très simplement repris le même principe pour TBO.",
                    "On a la possibilité d'augmenter la difficulté de nos parties via une trentaine d'options en tout et si on termine une partie, le niveau actuel de la partie devient notre record. En accomplissant certains records, on débloque de nouvelles difficultés pour aller toujours plus loin dans la souffrance.",
                    {
                        "subtype": "image",
                        "src": "",
                        "alt": "Tableau de simulation dans TBO",
                        "width": "",
                        "height": "",
                        "figcaption": "Tableau de simulation dans TBO"
                    },
                    "Toutes ces idées sont plutôt bonnes et après les avoir développées, je me suis dit que le jeu était fini. J'allais passer à autre chose, partir sur un autre jeu, mais je me suis dit \"et pourquoi pas sortir le jeu sur Steam\"."
                ]
            },
            {
                "type": "h2",
                "content": "😲Une tournure inattendue !"
            },
            {
                "type": "block",
                "content": [
                    "Une idée assez farfelue non ? Mon tout premier jeu, sorti sur Steam. Normalement un premier jeu ne sort jamais de votre ordinateur. Il faut attendre d'en faire plusieurs pour arriver à un résultat potable. Et pourtant, en regardant TBO je me suis dit qu'il serait certainement possible d'en faire un jeu potable.",
                    "En termes de contenus, le jeu est passable. Sa difficulté le rend très difficile à terminer et l'avantage des rogue like est la rejouabilité infinie.",
                    "Pour en faire un vrai jeu, il lui faut surtout un gros coup de polissage visuel. Il faut des graphismes plus jolis, des jeux de lumières et aussi un boss de fin.",
                    "En ce qui concerne les graphiques, j'ai d'abord travaillé sur un système de lumière ambiante permettant d'accentuer l'aspect caverne du jeu. On y voit clair qu'en étant proche d'une torche et les zones d'ombre augmentent la vigilance du joueur pour ne pas se faire surprendre par un monstre qui s'y cacherait.",
                    "Ensuite, je me suis attaqué aux salles en elle-même. Je voulais avoir des salles remplies de décors. En termes de budget, celà était impossible. Je devais me restreindre. L'idée m'est donc venue de décorer uniquement les salles de PNJ.",
                    "Chacune d'entre elles possède un thème lié au PNJ et aux objets qu'il donne. Alors, pourquoi ne pas décorer également la salle ?",
                    {
                        "subtype": "image",
                        "src": "",
                        "alt": "Images de quelques salles décorées dans TBO",
                        "width": "",
                        "height": "",
                        "figcaption": "Images de quelques salles décorées dans TBO"
                    },
                    "Pour compléter un peu plus le jeu, je me suis dit qu'avoir un minimum de lore serait sympathique. J'ai demandé à un ami qui aime écrire des histoires, de me développer un lore autour d'un axe simple. Les machines dominent le monde. Elles ont asservi les êtres humains et les utilisent pour faire des tests. Oui il y a une grosse vibe Portal ! Je vous laisse jouer au jeu pour en découvrir toutes les subtilités.",
                    "Pour qu'une partie puisse se terminer, il fallait créer un boss. Je ne vais pas trop vous détailler ce monstre, car il faut bien laisser quelques surprises, mais je vous garantis que vous y passerez beaucoup de temps !",
                    "Le dernier ajout sera une mécanique de gameplay. Dans le jeu on passe notre temps à attaquer des ennemis. On le fait sans vraiment savoir comment. Je me suis dit qu'avoir des armes avec chacune un pouvoir unique serait sympa et rajouterai encore plus de profondeur à la stratégie de gameplay. Les armes auraient un mode normal et épique qui augmenterait encore plus le bonus qu'elle procure.",
                    "Maintenant que tout cela est prêt, plus qu'à préparer la sortie de The Big One."
                ]
            },
            {
                "type": "h2",
                "content": "🏁The Big One V1.0"
            },
            {
                "type": "block",
                "content": [
                    "On y arrive presque. Plus que quelques semaines et mon premier jeu sera en ligne ! Cette dernière partie est assez peu intéressante en termes de développement puisqu'il s'agit surtout d'administratif.",
                    "Créer sa société, s'inscrire sur Steamworks, fournir ses informations bancaires et fiscales. Tout cela m'ennuie au plus au point, mais il faut bien passer par là si l'on veut devenir un vrai développeur de jeux vidéo.",
                    "Pour une mise en ligne de son jeu et particulièrement sur Steam, il est important d'y ajouter des succès. Ces derniers sont un bon moyen d'attirer des joueurs sur son jeu et aussi de les pousser à y jouer pour essayer d'avoir une collection complète. En tout le jeu possède 70 succès, dont certains qui sont réellement impossibles et d'autres qui se débloquent très rapidement.",
                    "Après cela, quelques derniers ajustements sur le jeu, les touches finales sur la page du magasin et la mise en ligne de l'archive du jeu qui sera téléchargée par les joueurs.",
                    "Plus qu'à attendre la sortie, espérer que le jeu percera un petit peu et mettre un point final à ce projet d'un an et une aventure folle ! Le reste appartient à l'histoire.",
                    "Voilà qui conclut ce blog sur l'aventure The Big One, j'espère que vous avez aimé lire le déroulé de sa création et que cela vous a inspiré et vous amènera à créer votre propre jeu.",
                    "On se retrouve dans un prochain blog. Ciao."
                ]
            }
        ]
    },
    {
        "id": "81b24230-a120-43a4-940c-f05031f8d955",
        "blogNumber": 2,
        "blogType": "Article",
        "title": "Jusqu'à le réaliser, le rêve du premier jeu.",
        "description": "Réaliser ses rêves est la plus belle chose de la vie ! C'est le but que je me fixe jour après jour et mon plus grand rêve a toujours été de développer des jeux vidéo. Aujourd'hui je vais vous raconter l'incroyable aventure sur la conception de mon premier jeu vidéo : The Big One.",
        "date": "01/01/2000",
        "writer": "Julien",
        "body": [
            {
                "type": "block",
                "content": [
                    "Réaliser ses rêves est la plus belle chose de la vie ! C'est le but que je me fixe jour après jour et mon plus grand rêve a toujours été de développer des jeux vidéo. Aujourd'hui je vais vous raconter l'incroyable aventure sur la conception de mon premier jeu vidéo : The Big One.",
                    "De la genèse de l'idée en 2016 jusqu'à la reprise du projet en 2022 en passant par toutes les étapes importantes du développement, vous saurez TOUT dans ce blog !",
                    "Sans plus attendre, faisons un bon dans le temps pour revenir début 2016 où le jeune homme que j'étais, commençait tout juste ses premiers jeux."
                ]
            },
            {
                "type": "h2",
                "content": "📆The Big One, une idée qui date !"
            },
            {
                "type": "block",
                "content": [
                    "Depuis toujours, je suis un fan des jeux difficiles. Passer des heures à faire le même mouvement en boucle pour réussir à le passer parfaitement est pour moi quelque chose de normal. Je sais, je suis bizarre ! Pourtant, beaucoup de joueurs sont comme moi et il existe des tas de jeux qui se basent sur ce principe.",
                    "Un jour je regardais un film quelconque et une scène m'a particulièrement inspiré : un hackeur, chez lui, qui aide des criminels. De cela me vient l'idée de faire un jeu où l'on jouerait un hackeur dans sa chambre qui aiderait des inconnus à commettre des crimes sous forme de contrat que l'on accepterait, avec pour but de faire le plus gros braquage de banque de l'histoire nommée “The Big One”. Le lore est simple et efficace. Passons au gameplay maintenant.",
                    "Dans ce film, le hackeur écrit très vite sans jamais regarder son clavier et fait des dizaines de choses extrêmement rapidement. Cette scène m'a fait penser au jeu Cook Serve & Delicious auquel je jouais à la même période où le but était de préparer des commandes pour des clients. Pour ce faire, on devait appuyer sur une suite de touches, dans un ordre bien précis et si on se ratait alors on obtenait un malus.",
                    {
                        "subtype": "image",
                        "src": "",
                        "alt": "Cook Serve & Delicious",
                        "width": "",
                        "height": "",
                        "figcaption": "Cook Serve & Delicious"
                    },
                    "Maintenant que le jeu possède un lore et un gameplay, il est temps de commencer à développer l'idée.",
                    "A cette époque, je ne savais pas développer des jeux vidéo. Je ne savais pas utiliser Unity n'y aucun autre logiciel de ce genre et je ne savais pas développer en C# n'y aucun autre langage. La seule chose que je savais un minimum utilisé était Photoshop. Je l'ai alors ouvert et j'ai commencé à modéliser les premières assets.",
                    "En parallèle de cela, je commençais également à écrire un peu plus le lore. Le jeu était articulé sous forme de journée pendant lesquelles on accomplissait des activités sous couvert d'une quête unique chaque jour. Il fallait donc écrire une dizaine de quête puis une grosse quête finale qui était le braquage.",
                    {
                        "subtype": "image",
                        "src": "",
                        "alt": "Image de l'idée de base de The Big One",
                        "width": "",
                        "height": "",
                        "figcaption": "Image de l'idée de base de The Big One"
                    },
                    "Voilà. C'est à peu près tout. Le principe était simple, mais plutôt sympa. J'ai développé cette idée pendant environ un an, jusqu'à la ranger dans un placard pour de bon. Enfin c'est ce que je pensais…"
                ]
            },
            {
                "type": "h2",
                "content": "💻Les débuts du développement."
            },
            {
                "type": "block",
                "content": [
                    "On se téléporte des années plus tard jusqu'à arriver en février 2022. À ce moment je suis toujours en plein apprentissage de Unity et du C# quand me vient à l'idée de faire mon premier petit jeu en partant de zéro.",
                    "À ce moment-là, je suis en train de suivre un cours (disponible dans le blog \"Comment j'ai appris à faire des jeux vidéos ?\") sur l'apprentissage de jeux 2D. L'envie me prend de développer un jeu de plateforme simple, avec quelques monstres et des points de vie. Rien d'extravagant et surtout un jeu qui me prendrait quelques semaines à réaliser tout au plus. Je me lance donc dans l'achat de mes premières assets pour habiller un peu le jeu.",
                    "Assez vite, l'idée de The Big One que j'avais eu plusieurs années auparavant me revient en tête. Je commence à me dire \"si je combine le principe de gameplay de The Big One avec un jeu de plateforme ça donnerait quoi\". De là, je me lance dans la création du système de déplacement puis dans celui de combat.",
                    "Comme j'aimais beaucoup l'idée de base, je l'ai gardé comme telle. Le principe est simple : un monstre est devant nous, on appuie sur une touche pour lancer l'activité (la suite de touches à réaliser), on appuie ensuite sur les touches qui apparaissent à l'écran dans l'ordre indiqué, puis si on a fait cela correctement le monstre prend des dégâts. On répète cette action jusqu'à venir à bout du monstre puis on passe à la suite.",
                    "La difficulté du jeu réside dans les suites de touches à réaliser. J'avais la possibilité de faire des séries courtes d'environ trois touches, mais aussi des séries beaucoup plus longues allant jusqu'à six voire sept touches.",
                    {
                        "subtype": "image",
                        "src": "",
                        "alt": "Image d'une activité lancée dans TBO",
                        "width": "",
                        "height": "",
                        "figcaption": "Image d'une activité lancée dans TBO"
                    },
                    "Le gameplay de base étant fixé, il faut maintenant que les monstres puissent nous attaquer. En effet, il est très peu intéressant de combattre des monstres qui sont incapables de vous attaquer à leur tour.",
                    "En cherchant un peu sur le web je suis tombé sur un artiste appelé RGSDev. Cette artiste à l'époque avait déjà réalisé bon nombre de petits monstres qui convenaient parfaitement pour mon jeu. Je lui en ai donc acheté quelques-uns et je suis reparti sur Unity pour développer les IA.",
                    "Le premier monstre que j'ai réalisé était des plus simples. Une chauve-souris qui quand on entre dans son cercle de détection se met à vous poursuivre sans relâche. Si elle vous touche, alors vous prenez des dégâts.",
                    {
                        "subtype": "image",
                        "src": "",
                        "alt": "Chauve-souris dans TBO pourchassant le joueur",
                        "width": "",
                        "height": "",
                        "figcaption": "Chauve-souris dans TBO pourchassant le joueur"
                    },
                    "Après cela j'ai continué à développer d'autres monstres avec d'autres comportements. Mon but était de définir un monstre par son attaque. Quand le joueur allait rencontrer un certain monstre, il saurait tout de suite comment l'esquiver.",
                    "Bon tout ça c'est super, mais maintenant il va bien falloir créer un but à ce jeu !"
                ]
            },
            {
                "type": "h2",
                "content": "👌Un petit côté rogue-like…"
            },
            {
                "type": "block",
                "content": [
                    "Mon style de jeu préféré est certainement le rogue-like. Vider des salles remplies de monstres, ramasser des objets pour devenir encore plus fort, mourir en boucle et recommencer pour aller toujours plus loin… Ce principe est si simple et à la fois si jouissif ! Quand vous réussissez à battre ce boss qui vous avait martyrisé beaucoup trop souvent, vous ressentez un tel sentiment d'accomplissement. Vous poursuivez votre aventure en vous sentant invincible et là vous mourrez face au premier monstre de l'étage suivant, car il est encore plus dur que le boss que vous venez d'affronter…",
                    "Je me suis dit que ce style de jeu pourrait parfaitement coller à The Big One. Je possède des monstres, il faut les tuer pour vider des salles et passer à la prochaine. Manque plus que des objets à ramasser pour rendre le joueur plus fort et le tour est joué.",
                    "Je me suis donc mis en tête de développer des objets que l'on pourrait ramasser dans des salles spéciales qui auraient à chaque fois un thème particulier lié à l'objet. J'avais déjà quelques idées en tête comme une salle d'alchimie, une forge, une taverne ou même une église.",
                    "Après plusieurs semaines de réflexion je finis par avoir un petit pool d'environ vingt objets tous plus débiles les uns que les autres ! Ils seront donnés par huit PNJ différents qui auront chacun leur thème :",
                    {
                        "subtype": "list",
                        "subcontent": [
                            "L'alchimiste",
                            "Le bard",
                            "Le forgeron",
                            "Le chef cuisinier",
                            "Le fermier",
                            "Le mineur",
                            "Le prêtre",
                            "Le marchand"
                        ]
                    },
                    "Ces PNJ se trouveront dans une salle qui apparaîtra de manière aléatoire tout au long d'une partie. Au total, il serait possible de rencontrer entre trois à six PNJ dans toute une partie.",
                    "Tout cela est super, mais si jamais le joueur n'a pas de chance et qu'il ne rencontre que peu de PNJ et qu'en plus de cela, les objets qu'on lui propose sont parmi les plus nuls, comment faire pour quand même le rendre un minimum fort ? Oui c'est ça ! Des augmentations de statistiques !",
                    "A chaque fois que le joueur aura vidé une salle, il aura un pourcentage de chance d'avoir droit à une augmentation de statistiques parmi deux choix. Si malheureusement le joueur n'a pas de chance, alors le taux de pourcentage augmentera. À la prochaine salle il aura donc plus de chance d'obtenir un bonus. Quand il obtiendra enfin un bonus, le pourcentage retombera à sa valeur initiale.",
                    {
                        "subtype": "image",
                        "src": "",
                        "alt": "Tableau de statistique dans TBO",
                        "width": "",
                        "height": "",
                        "figcaption": "Tableau de statistique dans TBO"
                    },
                    "Comme pour les objets, je passe quelques semaines à trouver des idées histoire que le pool de statistiques soit intéressant. Je range tout ça dans des catégories avec un pourcentage de tomber sur une statistique d'une catégorie en particulier et le tour est joué.",
                    "Pfiou ! Voilà déjà un contenu intéressant. Manque plus que de tester le jeu auprès du public. Pour cela, j'ai fait appel à quelques-uns de mes proches en leur demandant de faire les bêta testeur.",
                    "Comme ce blog est déjà bien long, je vous donne rendez-vous très prochainement pour la deuxième partie."
                ]
            }
        ]
    },
    {
        "id": "8191588b-9709-4395-bb7a-65d40ced331e",
        "blogNumber": 1,
        "blogType": "Article",
        "title": "Comment j'ai appris à faire des jeux vidéos ?",
        "description": "Vous aussi vous rêvez de faire vos propres jeux vidéo ? Vous aimeriez apprendre à coder ou encore utiliser les logiciels tels que Unity, mais vous ne savez pas par où commencer ? Alors, vous êtes au bon endroit ! Dans ce blog je vais vous détailler mon parcours d'apprentissage avec tous les liens utiles que j'ai suivis pour devenir développeur de jeux vidéo.",
        "date": "01/01/2000",
        "writer": "Julien",
        "body": [
            {
                "type": "block",
                "content": [
                    "Vous aussi vous rêvez de faire vos propres jeux vidéo ? Vous aimeriez apprendre à coder ou encore utiliser les logiciels tels que Unity, mais vous ne savez pas par où commencer ?",
                    "Alors, vous êtes au bon endroit ! Dans ce blog je vais vous détailler mon parcours d'apprentissage avec tous les liens utiles que j'ai suivis pour devenir développeur de jeux vidéo."
                ]
            },
            {
                "type": "h2",
                "content": "🚫Petit disclaimer."
            },
            {
                "type": "block",
                "content": [
                    "Avant toute chose, je tiens à préciser que cet article ne définit pas un chemin parfait pour devenir développeur de jeux vidéo.",
                    "Je vais vous parler de mon parcours, comment j'en suis arrivé là et grâce à quels outils, mais il est évident que ce n'est pas le seul moyen d'y arriver.",
                    "Chaque personne aura son propre style d'apprentissage. Certains préféreront les vidéos, d'autres les cours écrits et les plus fous essaieront d'apprendre tout seul.",
                    "Je tiens à ce que vous ne preniez pas pour argent comptant tout ce que vous trouverez dans ce blog. Cette méthode a marché pour moi, mais peut-être qu'elle ne sera pas adaptée à vous.",
                    "Maintenant que tout cela est dit, plongeons-nous au cœur du sujet !"
                ]
            },
            {
                "type": "h2",
                "content": "✅Trouver les bons cours."
            },
            {
                "type": "block",
                "content": [
                    "Quand il s'agit de chercher des cours sur comment apprendre le développement, il est très simple d'en trouver des centaines très rapidement. La vraie question est \"est-ce qu'avec ces cours je vais apprendre à faire des jeux vidéo\".",
                    "La réponse est simple : non ! Apprendre à faire des jeux vidéo ne se résume pas à des tutos de 10 minutes. Il est vrai qu'il existe des vidéos qui vous apprennent à créer de petits jeux très rapidement. Cela vous permet de découvrir les logiciels et les langages utilisés, mais il faut les prendre comme une brève introduction à un monde bien plus complexe.",
                    "Il est tout à fait possible de s'arrêter à ce genre de contenu. Je ne critique aucunement ces vidéos et les personnes qui les consultent ! Elles sont nécessaires pour vulgariser ce métier et permettre à monsieur et madame tout le monde de comprendre le fonctionnement de tout ceci et peut-être s'y intéresser.",
                    "Si vous êtes plus curieux et que vous aimeriez voir vos idées prendre vie, alors il va falloir aller plus loin que cela. Beaucoup plus loin !"
                ]
            },
            {
                "type": "h2",
                "content": "🤔Choisir sa branche, une partie essentielle."
            },
            {
                "type": "block",
                "content": [
                    "Développer des jeux vidéo regroupe beaucoup de métiers. En réalité, le terme \"développeur de jeux vidéo\" ne veut pas dire grand chose. Vous y trouverez des programmeurs, des designers 3D, des dessinateurs, des musiciens, des chefs de projets, des testeurs et encore pleins d'autres que j'oublie.",
                    "Dans tout ce foutoir, il faut trouver ce qui nous attire vraiment. Ce métier pour lequel on vibre le matin en se levant. Ce métier qui nous donne l'impression de ne pas travailler.",
                    "Personnellement, ma réflexion a été très simple. Comme je l'ai déjà expliqué dans le premier blog \"Bienvenue dans la famille Salty Karma !\", je voulais donner vie à mes idées. Je m'en fichais que mon jeu soit beau ou qu'il est un environnement sonore agréable. Pour moi, l'important était de jouer ! Alors, ma décision s'est tournée vers la programmation.",
                    "Maintenant c'est à vous de trouver votre branche. Certains d'entre vous sont peut-être déjà fixés. D'autres ont peut-être été convaincus par mes arguments.",
                    "Pour ceux qui restent, je vous conseille de réfléchir à ce qui vous plaît dans le jeu vidéo. Posez-vous les bonnes questions et essayez de mettre en relation ce que vous aimez dans votre vie avec les métiers disponibles dans le milieu du jeu vidéo."
                ]
            },
            {
                "type": "h2",
                "content": "💰Udemy, une mine d'or pour l'apprentissage."
            },
            {
                "type": "block",
                "content": [
                    "Maintenant que vous êtes fixés (plus ou moins) sur le métier qui vous plait, il est temps de passer à l'apprentissage !",
                    "Évidemment, Youtube est le premier endroit où vous pouvez vous rendre. Il existe bon nombre de youtubeurs qualifiés qui vous apprendront à utiliser les outils pour réaliser ce que vous souhaitez.",
                    "L'autre option est de se tourner vers des cours payants. Certes il va falloir mettre la main à la poche et je sais que certains seront réticents, mais je vous assure que la qualité en sera grandement supérieure.",
                    "Le site numéro un dans la vente de cours en ligne est Udemy. Vous y trouverez une multitude de cours, dans des tas de langue, sur des tas de domaines. Pour une quinzaine d'euros en moyenne, vous aurez accès à des heures de cours vidéo avec très souvent des ressources pour vous exercer en simultané.",
                    "N'hésitez pas à parcourir le site pour y trouver des cours concernant les domaines que vous aimez."
                ]
            },
            {
                "type": "h2",
                "content": "📝Quel cours j'ai suivi ?"
            },
            {
                "type": "block",
                "content": [
                    "Pour celles et ceux qui aimeraient apprendre la programmation, je vous propose une liste non exhaustive de plusieurs cours de qualité que j'ai pu suivre.",
                    "Attention ! Ces cours concernent uniquement l'apprentissage du logiciel Unity et le langage C#. Si vous ne souhaitez pas développer vos jeux avec ces outils, cette liste vous sera malheureusement peu utile :",
                    {
                        "subtype": "list",
                        "subcontent": [
                            {
                                "link": "Complete C# Unity Game Developer 3D",
                                "href": "https://www.udemy.com/course/unitycourse2/"
                            },
                            {
                                "link": "Complete C# Unity Game Developer 2D",
                                "href": "https://www.udemy.com/course/unitycourse/"
                            },
                            {
                                "link": "RPG Core Combat Creator: Learn Intermediate Unity C# Coding",
                                "href": "https://www.udemy.com/course/unityrpg/"
                            },
                            {
                                "link": "Unity Dialogue & Quests: Intermediate C# Game Coding",
                                "href": "https://www.udemy.com/course/unity-dialogue-quests/"
                            },
                            {
                                "link": "Unity RPG Inventory Systems Asset Pack: Behind The Scenes",
                                "href": "https://www.udemy.com/course/unityinventory/"
                            },
                            {
                                "link": "RPG Shops & Abilities: Intermediate C# Game Coding",
                                "href": "https://www.udemy.com/course/rpg-shops-abilities/"
                            }
                        ]
                    },
                    "D'autres cours très intéressant sur la modélisation 3D et le pixel art :",
                    {
                        "subtype": "list",
                        "subcontent": [
                            {
                                "link": "The Blender 2.8 Encyclopedia",
                                "href": "https://www.udemy.com/course/the-blender-encyclopedia/"
                            },
                            {
                                "link": "Complete Blender Creator: Learn 3D Modeling for beginners",
                                "href": "https://www.udemy.com/course/blendertutorial/"
                            },
                            {
                                "link": "Creating 3D environments in Blender",
                                "href": "https://www.udemy.com/course/blender-environments/"
                            },
                            {
                                "link": "Pixel Art Fundamentals: Introduction to 3D Game Pixel Art",
                                "href": "https://www.udemy.com/course/pixel-art-fundamentals/"
                            },
                            {
                                "link": "Pixel Art Characters: 2D Character Design & Animation",
                                "href": "https://www.udemy.com/course/pixel-art-characters/"
                            }
                        ]
                    }
                ]
            },
            {
                "type": "h2",
                "content": "💪Pratiquer encore et encore !"
            },
            {
                "type": "block",
                "content": [
                    "Maintenant que vous avez toutes les cartes en main, il ne vous reste plus qu'à vous donner corps et âme ! Trouvez-vous une organisation qui vous convient et c'est parti !",
                    "Certains préféreront faire des plannings, d'autres feront ça de sans trop s'organiser. L'important est de pratiquer quotidiennement et surtout de pratiquer en dehors des cours que vous suivez. Essayez de faire plus que ce que l'on vous apprend. Creusez dans votre esprit pour aller toujours plus loin. Cela vous apprendra à conceptualiser vos jeux et ça vous sera très utile plus tard lors de vos propres projets.",
                    "Je vous souhaite à tous un bon apprentissage et rendez-vous dans un prochain blog."
                ]
            }
        ]
    },
    {
        "id": "fae8e46f-18e8-4631-a860-ed3eec72d52d",
        "blogNumber": 0,
        "blogType": "News",
        "title": "Bienvenue dans la famille Salty Karma.",
        "description": "Il est enfin là ! Le site officiel du studio Salty Karma sur lequel vous retrouverez régulièrement des blogs sur divers sujets et notamment des DevBlog sur le prochain projet du studio qui sera annoncé très prochainement ! Pour fêter cela avec vous, je vous propose une rétrospective sur la genèse du studio jusqu'à sa création et la sortie du premier jeu : The Big One.",
        "date": "01/01/2000",
        "writer": "Julien",
        "body": [
            {
                "type": "block",
                "content": [
                    "Il est enfin là ! Le site officiel du studio Salty Karma sur lequel vous retrouverez régulièrement des blogs sur divers sujets et notamment des DevBlog sur le prochain projet du studio qui sera annoncé très prochainement !",
                    "Pour fêter cela avec vous, je vous propose une rétrospective sur la genèse du studio jusqu'à sa création et la sortie du premier jeu : The Big One."
                ]
            },
            {
                "type": "h2",
                "content": "👶Salty Karma, un rêve d'enfant !"
            },
            {
                "type": "block",
                "content": [
                    "Avant de commencer, je souhaiterais faire un petit bon dans le temps et vous ramener au milieu des années 2000 quand le développeur que je suis aujourd'hui n'était alors qu'un enfant.",
                    "Quand vous aviez 10 ans, est-ce que vous vous souvenez de votre réponse à la question \"Tu veux faire quoi plus tard\" ? Pour moi, c'était déjà très clair. Sans même savoir ce que ça signifiait et avec toute l'insouciance d'un enfant de cet âge, je m'empressais de répondre \"développeur de jeux vidéo\".",
                    "Au-delà de développer des jeux vidéos, mon rêve final était d'un jour avoir mon propre studio, avec mes employés et être à l'origine d'une ambiance de travail géniale tout en construisant les jeux de demain.",
                    "Bon… Tout ça prend évidemment du temps et les marches doivent se gravir une par une. J'ai donc continué de grandir et arriver à l'adolescence, il était temps de commencer réellement cette aventure !"
                ]
            },
            {
                "type": "h2",
                "content": "❓Quel sera mon domaine ?"
            },
            {
                "type": "block",
                "content": [
                    "Quand on parle de \"développer des jeux vidéos\" personne ne sait vraiment ce que ça signifie. On voit des personnes faire du code, d'autres dessiner et même faire de la musique. Autant de métiers ne peuvent être réalisés par une personne. Alors, il a fallu faire un choix.",
                    "En ce qui me concerne, la réflexion a été rapide. Dans le terme \"jeu vidéo\" il y a le mot \"jeu\". Qui dit jeu dit gameplay. Qui dit gameplay dit programmation. Fin de la réflexion.",
                    "Évidemment, ce choix a quand même été un peu plus compliqué (un tout petit peu), mais il était pour moi clair que jouer à des jeux moches et insonores était plus intéressant que d'avoir des croquis et espérer les voir bouger.",
                    "Maintenant que je suis fixé sûr tout ça, il faut désormais apprendre. Et oui ! Les petits bonhommes ne vont pas se déplacer tout seul."
                ]
            },
            {
                "type": "h2",
                "content": "📚Un apprentissage fastidieux."
            },
            {
                "type": "block",
                "content": [
                    "Alors, comment faire pour apprendre à faire des jeux vidéos ? La réponse : internet ! Je pars donc à la recherche d'informations et je tombe rapidement sur divers vidéos, blogs et cours payants qui promettent tous monts et merveilles.",
                    "Un truc à savoir : aucun cours ne vous apprendra réellement à faire des jeux vidéo. Vous arriverez à obtenir des bases très solides, mais la pratique est l'unique façon de faire.",
                    "Pendant près de trois ans, j'ai suivi quotidiennement des cours en développant de petits projets pour acquérir assez d'expérience pour me lancer.",
                    "Je détaillerai les différents cours que j'ai pu suivre dans un prochain blog, si jamais vous souhaitez vous aussi obtenir des bases solides en développement."
                ]
            },
            {
                "type": "h2",
                "content": "🎮Jusqu'à le réaliser, le rêve du premier jeu."
            },
            {
                "type": "block",
                "content": [
                    "Apprendre c'est bien, mais créer c'est mieux ! Au bout d'un moment il faut se lancer ! Prendre le taureau par les cornes et cliquer sur \"Create Project\".",
                    "En février 2022, j'ai commencé mon premier projet avec comme ambition de produire un jeu \"potable\". L'ambition était faible et je ne pensais pas que cela finirait ainsi !",
                    "Je ferai très prochainement un blog exclusif sur l'aventure du développement de The Big One. Je vous donne rendez-vous dans ce blog pour en apprendre plus sur cette aventure."
                ]
            },
            {
                "type": "h2",
                "content": "👀D'où vient le nom du studio ?"
            },
            {
                "type": "block",
                "content": [
                    {
                        "subtype": "image",
                        "src": "/src/assets/salty_karma_logo.webp",
                        "alt": "Premier logo de Salty Karma",
                        "width": "250",
                        "height": "250",
                        "figcaption": "Premier logo de Salty Karma"
                    },
                    "Vous aussi vous jouez à des jeux compétitifs en ligne ? Vous aussi vous ragez ? Vous êtes salés ?",
                    "Vous aussi quand vous vous croyez trop fort vous vous faites calmer ? Vous vous faites karma ?",
                    "Si vous réunissez tous ces paramètres, alors bienvenue dans la Salty Karma familly !!"
                ]
            },
            {
                "type": "h2",
                "content": "💬Derniers mots."
            },
            {
                "type": "block",
                "content": [
                    "Cette aventure est déjà bien lancée, mais elle ne fait que commencer ! Un deuxième jeu est déjà sur les rails et je vous en parlerai très prochainement. ",
                    "D'ici là n'hésitez pas à découvrir The Big One disponible sur Steam, à rejoindre le Discord et à partager tout cela autour de vous, car cette aventure est aussi la vôtre !",
                    "Croyez en vous, croyez en vos rêves et travaillez pour atteindre vos objectifs, car il n'y a rien de plus beau que de vivre sa passion !"
                ]
            }
        ]
    }
]
